routes_app/app/controllers/artworks_controller.rb

    def index
        # render json: Artwork.all

            render json: Artwork.find(:artist_id)

            if params.has_key?(:artist_id)
                # index of nested resource
                artworks = Artwork.where(artist_id: params[:artist_id])
              else
                # index of top-level resource
                artworks = Artworks.all
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"