routes_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "diego"], ["updated_at", "2022-06-30 18:33:25.725410"], ["id", 3]]
---
    def update
        #debugger
        user = User.find(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        # debugger
        user = User.find(params[:id])
        user.destroy